[
  {
    "title": "Automation and Control Technical Manager",
    "company": "EOS, Orcoyen, Spain",
    "period": {
      "start": "June 2017",
      "end": "present"
    },
    "details": [
      "Technical Manager of EMPRO, a SCADA designed to monitor and control renewable energy generation and industrial facilities.",
      "Principal responsibilities:",
      "◌ Coordinate and lead development team from a technical point of view.",
      "◌ Design, develop, implement and deploy new parts of the system."
    ]
  },
  {
    "title": "Computer Engineer (internship)",
    "company": "EOS, Orcoyen, Spain",
    "period": {
      "start": "February 2017",
      "end": "June 2017"
    },
    "details": "<p>Analysis of data collected by the SCADA system for photovoltaic plants using techniques close to Big Data. I created an autonomous system to generate temporary reports that help to understand the sharing of the plant and the failures that can occur in it.</p>"
  },
  {
    "title": "Software Developer (internship)",
    "company": "Valco Melton, Orcoyen, Spain",
    "period": {
      "start": "September 2016",
      "end": "December 2016"
    },
    "details": "Practices developing web utilities for internal use, with the aim of improving the productivity of the company. Most of the projects were developed in HTML, CSS and JS, supported by <a href='http://backbonejs.org/' target='_blank'>Backbone.JS</a> and <a href='http://materializecss.com/' target='_blank'>Materialize</a> libraries."
  },
  {
    "title": "SCADA Engineer",
    "company": "EOS, Orcoyen, Spain",
    "period": {
      "start": "July 2016",
      "end": " September 2016"
    },
    "details": "Design and implement a data acquisition system for real time SCADA system. The project involves collecting data from different systems on a solar power plant and then put it in a database. Data acquisition part was developed in C ++ using <a href='https://libmodbus.org' target='_blank'>libmodbus</a>. In addition, we implemented a <a href='https://nodejs.org' target='_blank'>NodeJS</a> server to facilitate data insertion.</p>"
  }
]